---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures
source: html/9d173a14-245a-f361-4f1e-f43cdeee3b74.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures

Failures related to the split sketched based element.

## Syntax (C#)
```csharp
public static class SplitSketchBasedElementFailures
```